bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATxmega32E5-AU" package="TQFP32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega32E5-MU" package="VQFN32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega32E5-M4U" package="UQFN32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega32E5-AN" package="TQFP32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="105"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega32E5-MN" package="VQFN32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="105"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega32E5-M4N" package="UQFN32" pinout="QFP_QFN_32" speedmax="32000000" tempmax="105"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    </variants>
    <device name="ATxmega32E5" architecture="AVR8_XMEGA" avr-family="AVR XMEGA" family="AVR8">
        <address-spaces>
            <address-space name="prog" id="prog" start="0x00000" size="0x9000" endianness="little">
                <memory-segment start="0x00000" size="0x8000" type="flash" rw="RW" exec="1" name="APP_SECTION"
                                pagesize="128"/>
                <memory-segment start="0x07000" size="0x1000" type="flash" rw="RW" exec="1" name="APPTABLE_SECTION"
                                pagesize="128"/>
                <memory-segment start="0x08000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION"
                                pagesize="128"/>
            </address-space>
            <address-space name="data" id="data" start="0x0000" size="0x3000" endianness="little">
                <memory-segment start="0x0000" size="0x1000" type="io" rw="RW" exec="0" name="IO"/>
                <memory-segment start="0x1000" size="0x0400" type="eeprom" rw="RW" exec="0" name="MAPPED_EEPROM"/>
                <memory-segment start="0x2000" size="0x1000" type="ram" rw="RW" exec="0" name="INTERNAL_SRAM"/>
            </address-space>
            <address-space name="eeprom" id="eeprom" start="0x00000" size="0x0400">
                <memory-segment start="0x00000" size="0x0400" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="32"/>
            </address-space>
            <address-space name="signatures" id="signatures" start="0x0000" size="0x0003">
                <memory-segment start="0x0000" size="0x0003" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space name="fuses" id="fuses" start="0x0000" size="0x0007">
                <memory-segment start="0x0000" size="0x0007" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space name="lockbits" id="lockbits" start="0x0000" size="0x0001">
                <memory-segment start="0x0000" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space name="user_signatures" id="user_signatures" start="0x0000" size="0x0080">
                <memory-segment start="0x0000" size="0x0080" type="user_signatures" rw="RW" exec="0"
                                name="USER_SIGNATURES" pagesize="128"/>
            </address-space>
            <address-space name="prod_signatures" id="prod_signatures" start="0x0000" size="0x0036">
                <memory-segment start="0x0000" size="0x0036" type="other" rw="R" exec="0" name="PROD_SIGNATURES"
                                pagesize="128"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="GPIO" id="I6085" version="XMEGAD">
                <instance name="GPIO">
                    <register-group address-space="data" offset="0x0000" name-in-module="GPIO" name="GPIO"/>
                </instance>
            </module>
            <module name="VPORT" id="I6075" version="XMEGAE">
                <instance name="VPORT0">
                    <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
                </instance>
                <instance name="VPORT1">
                    <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                </instance>
                <instance name="VPORT2">
                    <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                </instance>
                <instance name="VPORT3">
                    <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                </instance>
            </module>
            <module name="XOCD" id="I6043">
                <instance name="OCD">
                    <register-group address-space="data" offset="0x002E" name-in-module="OCD" name="OCD"/>
                </instance>
            </module>
            <module name="CPU" id="I6000">
                <instance name="CPU">
                    <register-group address-space="data" offset="0x0030" name-in-module="CPU" name="CPU"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V3XJ"/>
                    </parameters>
                </instance>
            </module>
            <module name="CLK" id="I6073" version="XMEGAE">
                <instance name="CLK">
                    <register-group address-space="data" offset="0x0040" name-in-module="CLK" name="CLK"/>
                    <signals>
                        <signal function="EXTERNAL_CLOCK" group="EXTCLK" pad="PC4"/>
                    </signals>
                </instance>
            </module>
            <module name="PR" id="I6073" version="XMEGAE">
                <instance name="PR">
                    <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
