bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
            <value-group caption="Prescaler A Division Factor" name="CLK_PSADIV">
                <value caption="Divide by 1" name="1" value="0x00"/>
                <value caption="Divide by 2" name="2" value="0x01"/>
                <value caption="Divide by 4" name="4" value="0x03"/>
                <value caption="Divide by 8" name="8" value="0x05"/>
                <value caption="Divide by 16" name="16" value="0x07"/>
                <value caption="Divide by 32" name="32" value="0x09"/>
                <value caption="Divide by 64" name="64" value="0x0B"/>
                <value caption="Divide by 128" name="128" value="0x0D"/>
                <value caption="Divide by 256" name="256" value="0x0F"/>
                <value caption="Divide by 512" name="512" value="0x11"/>
                <value caption="Divide by 6" name="6" value="0x13"/>
                <value caption="Divide by 10" name="10" value="0x15"/>
                <value caption="Divide by 12" name="12" value="0x17"/>
                <value caption="Divide by 24" name="24" value="0x19"/>
                <value caption="Divide by 48" name="48" value="0x1B"/>
            </value-group>
            <value-group caption="Prescaler B and C Division Factor" name="CLK_PSBCDIV">
                <value caption="Divide B by 1 and C by 1" name="1_1" value="0x00"/>
                <value caption="Divide B by 1 and C by 2" name="1_2" value="0x01"/>
                <value caption="Divide B by 4 and C by 1" name="4_1" value="0x02"/>
                <value caption="Divide B by 2 and C by 2" name="2_2" value="0x03"/>
            </value-group>
            <value-group caption="RTC Clock Source" name="CLK_RTCSRC">
                <value caption="1.024 kHz from internal 32kHz ULP" name="ULP" value="0x00"/>
                <value caption="1.024 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC" value="0x01"/>
                <value caption="1.024 kHz from internal 32.768 kHz RC oscillator" name="RCOSC" value="0x02"/>
                <value caption="32.768 kHz from 32.768 kHz crystal oscillator on TOSC" name="TOSC32" value="0x05"/>
                <value caption="32.768 kHz from internal 32.768 kHz RC oscillator" name="RCOSC32" value="0x06"/>
                <value caption="External Clock from TOSC1" name="EXTCLK" value="0x07"/>
            </value-group>
        </module>
        <module name="PR" id="I6073" version="XMEGAE" caption="Power Reduction">
            <register-group caption="Power Reduction" name="PR" size="7">
                <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
                    <bitfield caption="XMEGA Custom Logic" mask="0x80" name="XCL"/>
                    <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
                    <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
                    <bitfield caption="Enhanced DMA-Controller" mask="0x01" name="EDMA"/>
                </register>
                <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
                    <bitfield caption="Port A DAC" mask="0x04" name="DAC"/>
                    <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
                    <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
                </register>
                <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
                    <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
                    <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
                    <bitfield caption="Port C WEX" mask="0x04" name="HIRES"/>
                    <bitfield caption="Port C Timer/Counter5" mask="0x02" name="TC5"/>
                    <bitfield caption="Port C Timer/Counter4" mask="0x01" name="TC4"/>
                </register>
                <register caption="Power Reduction Port D" name="PRPD" offset="0x04" size="1">
                    <bitfield caption="Port D USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Port D Timer/Counter5" mask="0x02" name="TC5"/>
                </register>
            </register-group>
        </module>
        <module name="SLEEP" id="I6081" version="XMEGAAU" caption="Sleep Controller">
            <register-group caption="Sleep Controller" name="SLEEP" size="1">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Sleep Mode" mask="0x0E" name="SMODE" values="SLEEP_SMODE"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SEN"/>
                </register>
            </register-group>
            <value-group caption="Sleep Mode" name="SLEEP_SMODE">
                <value caption="Idle mode" name="IDLE" value="0x00"/>
                <value caption="Power-down Mode" name="PDOWN" value="0x02"/>
                <value caption="Power-save Mode" name="PSAVE" value="0x03"/>
                <value caption="Standby Mode" name="STDBY" value="0x06"/>
                <value caption="Extended Standby Mode" name="ESTDBY" value="0x07"/>
            </value-group>
        </module>
        <module name="OSC" id="I6079" version="XMEGAE" caption="Oscillator">
            <register-group caption="Oscillator" name="OSC" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Internal 8 MHz RC Low Power Mode Enable" mask="0x40" name="RC8MLPM"/>
                    <bitfield caption="Internal 8 MHz RC Oscillator Enable" mask="0x20" name="RC8MEN"/>
                    <bitfield caption="PLL Enable" mask="0x10" name="PLLEN"/>
                    <bitfield caption="External Oscillator Enable" mask="0x08" name="XOSCEN"/>
                    <bitfield caption="Internal 32.768 kHz RC Oscillator Enable" mask="0x04" name="RC32KEN"/>
                    <bitfield caption="Internal 32 MHz RC Oscillator Enable" mask="0x02" name="RC32MEN"/>
                    <bitfield caption="Internal 2 MHz RC Oscillator Enable" mask="0x01" name="RC2MEN"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Internal 8 MHz RC Oscillator Ready" mask="0x20" name="RC8MRDY"/>
                    <bitfield caption="PLL Ready" mask="0x10" name="PLLRDY"/>
                    <bitfield caption="External Oscillator Ready" mask="0x08" name="XOSCRDY"/>
                    <bitfield caption="Internal 32.768 kHz RC Oscillator Ready" mask="0x04" name="RC32KRDY"/>
                    <bitfield caption="Internal 32 MHz RC Oscillator Ready" mask="0x02" name="RC32MRDY"/>
                    <bitfield caption="Internal 2 MHz RC Oscillator Ready" mask="0x01" name="RC2MRDY"/>
                </register>
                <register caption="External Oscillator Control Register" name="XOSCCTRL" offset="0x02" size="1">
                    <bitfield caption="Frequency Range" mask="0xC0" name="FRQRANGE" values="OSC_FRQRANGE"/>
                    <bitfield caption="32.768 kHz XTAL OSC Low-power Mode" mask="0x20" name="X32KLPM"/>
                    <bitfield caption="16 MHz Crystal Oscillator High Power mode" mask="0x10" name="XOSCPWR"/>
                    <bitfield caption="External Oscillator Selection and Startup Time" mask="0x1F" name="XOSCSEL"
                              values="OSC_XOSCSEL"/>
                </register>
                <register caption="Oscillator Failure Detection Register" name="XOSCFAIL" offset="0x03" size="1">
                    <bitfield caption="PLL Failure Detection Interrupt Flag" mask="0x08" name="PLLFDIF"/>
                    <bitfield caption="PLL Failure Detection Enable" mask="0x04" name="PLLFDEN"/>
                    <bitfield caption="XOSC Failure Detection Interrupt Flag" mask="0x02" name="XOSCFDIF"/>
                    <bitfield caption="XOSC Failure Detection Enable" mask="0x01" name="XOSCFDEN"/>
                </register>
                <register caption="32.768 kHz Internal Oscillator Calibration Register" name="RC32KCAL" offset="0x04"
                          size="1"/>
                <register caption="PLL Control Register" name="PLLCTRL" offset="0x05" size="1">
                    <bitfield caption="Clock Source" mask="0xC0" name="PLLSRC" values="OSC_PLLSRC"/>
                    <bitfield caption="Divide by 2" mask="0x20" name="PLLDIV"/>
                    <bitfield caption="Multiplication Factor" mask="0x1F" name="PLLFAC"/>
                </register>
                <register caption="DFLL Control Register" name="DFLLCTRL" offset="0x06" size="1">
                    <bitfield caption="32 MHz DFLL Calibration Reference" mask="0x06" name="RC32MCREF"
                              values="OSC_RC32MCREF"/>
                </register>
                <register caption="Internal 8 MHz RC Oscillator Calibration Register" name="RC8MCAL" offset="0x07"
                          size="1">
                    <bitfield caption="Calibration Bits" mask="0xFF" name="RC8MCAL"/>
                </register>
            </register-group>
            <value-group caption="Oscillator Frequency Range" name="OSC_FRQRANGE">
                <value caption="0.4 - 2 MHz" name="04TO2" value="0x00"/>
                <value caption="2 - 9 MHz" name="2TO9" value="0x01"/>
                <value caption="9 - 12 MHz" name="9TO12" value="0x02"/>
                <value caption="12 - 16 MHz" name="12TO16" value="0x03"/>
            </value-group>
