bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
            <value-group caption="Current Limitation" name="ADC_CURRLIMIT">
                <value caption="No current limit,     300ksps max sampling rate" name="NO" value="0x00"/>
                <value caption="Low current limit,    250ksps max sampling rate" name="LOW" value="0x01"/>
                <value caption="Medium current limit, 150ksps max sampling rate" name="MED" value="0x02"/>
                <value caption="High current limit,   50ksps max sampling rate" name="HIGH" value="0x03"/>
            </value-group>
            <value-group caption="Conversion result resolution" name="ADC_RESOLUTION">
                <value caption="12-bit right-adjusted result" name="12BIT" value="0x00"/>
                <value caption="More than 12-bit (oversapling) right-adjusted result" name="MT12BIT" value="0x01"/>
                <value caption="8-bit right-adjusted result" name="8BIT" value="0x02"/>
                <value caption="12-bit left-adjusted result" name="LEFT12BIT" value="0x03"/>
            </value-group>
            <value-group caption="Voltage reference selection" name="ADC_REFSEL">
                <value caption="Internal 1V" name="INT1V" value="0x00"/>
                <value caption="Internal VCC / 1.6" name="INTVCC" value="0x01"/>
                <value caption="External reference on PORT A" name="AREFA" value="0x02"/>
                <value caption="External reference on PORT D" name="AREFD" value="0x03"/>
                <value caption="Internal VCC / 2" name="INTVCC2" value="0x04"/>
            </value-group>
            <value-group caption="Event channel input selection" name="ADC_EVSEL">
                <value caption="Event Channel 0" name="0" value="0x00"/>
                <value caption="Event Channel 1" name="1" value="0x01"/>
                <value caption="Event Channel 2" name="2" value="0x02"/>
                <value caption="Event Channel 3" name="3" value="0x03"/>
                <value caption="Event Channel 4" name="4" value="0x04"/>
                <value caption="Event Channel 5" name="5" value="0x05"/>
                <value caption="Event Channel 6" name="6" value="0x06"/>
                <value caption="Event Channel 7" name="7" value="0x07"/>
            </value-group>
            <value-group caption="Event action selection" name="ADC_EVACT">
                <value caption="No event action" name="NONE" value="0x00"/>
                <value caption="First event triggers channel conversion" name="CH0" value="0x01"/>
                <value caption="The ADC is flushed and restarted for accurate timing" name="SYNCSWEEP" value="0x06"/>
            </value-group>
            <value-group caption="Clock prescaler" name="ADC_PRESCALER">
                <value caption="Divide clock by 4" name="DIV4" value="0x00"/>
                <value caption="Divide clock by 8" name="DIV8" value="0x01"/>
                <value caption="Divide clock by 16" name="DIV16" value="0x02"/>
                <value caption="Divide clock by 32" name="DIV32" value="0x03"/>
                <value caption="Divide clock by 64" name="DIV64" value="0x04"/>
                <value caption="Divide clock by 128" name="DIV128" value="0x05"/>
                <value caption="Divide clock by 256" name="DIV256" value="0x06"/>
                <value caption="Divide clock by 512" name="DIV512" value="0x07"/>
            </value-group>
            <value-group caption="Gain factor" name="ADC_CH_GAIN">
                <value caption="1x gain" name="1X" value="0x00"/>
                <value caption="2x gain" name="2X" value="0x01"/>
                <value caption="4x gain" name="4X" value="0x02"/>
                <value caption="8x gain" name="8X" value="0x03"/>
                <value caption="16x gain" name="16X" value="0x04"/>
                <value caption="32x gain" name="32X" value="0x05"/>
                <value caption="64x gain" name="64X" value="0x06"/>
                <value caption="x/2 gain" name="DIV2" value="0x07"/>
            </value-group>
            <value-group caption="Input mode" name="ADC_CH_INPUTMODE">
                <value caption="Internal inputs, no gain" name="INTERNAL" value="0x00"/>
                <value caption="Single-ended input, no gain" name="SINGLEENDED" value="0x01"/>
                <value caption="Differential input, gain with 4 LSB pins selection" name="DIFFWGAINL" value="0x02"/>
                <value caption="Differential input, gain with 4 MSB pins selection" name="DIFFWGAINH" value="0x03"/>
            </value-group>
            <value-group caption="Positive input multiplexer selection" name="ADC_CH_MUXPOS">
                <value caption="Input pin 0" name="PIN0" value="0x00"/>
                <value caption="Input pin 1" name="PIN1" value="0x01"/>
                <value caption="Input pin 2" name="PIN2" value="0x02"/>
                <value caption="Input pin 3" name="PIN3" value="0x03"/>
                <value caption="Input pin 4" name="PIN4" value="0x04"/>
                <value caption="Input pin 5" name="PIN5" value="0x05"/>
                <value caption="Input pin 6" name="PIN6" value="0x06"/>
                <value caption="Input pin 7" name="PIN7" value="0x07"/>
                <value caption="Input pin 8" name="PIN8" value="0x08"/>
                <value caption="Input pin 9" name="PIN9" value="0x09"/>
                <value caption="Input pin 10" name="PIN10" value="0x0A"/>
                <value caption="Input pin 11" name="PIN11" value="0x0B"/>
                <value caption="Input pin 12" name="PIN12" value="0x0C"/>
                <value caption="Input pin 13" name="PIN13" value="0x0D"/>
                <value caption="Input pin 14" name="PIN14" value="0x0E"/>
                <value caption="Input pin 15" name="PIN15" value="0x0F"/>
            </value-group>
            <value-group caption="Internal input multiplexer selections" name="ADC_CH_MUXINT">
                <value caption="Temperature Reference" name="TEMP" value="0x00"/>
                <value caption="Bandgap Reference" name="BANDGAP" value="0x01"/>
                <value caption="1/10 Scaled VCC" name="SCALEDVCC" value="0x02"/>
                <value caption="DAC Output" name="DAC" value="0x03"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection" name="ADC_CH_MUXNEG">
                <value caption="Input pin 0 (Input Mode = 2)" name="PIN0" value="0x00"/>
                <value caption="Input pin 1 (Input Mode = 2)" name="PIN1" value="0x01"/>
                <value caption="Input pin 2 (Input Mode = 2)" name="PIN2" value="0x02"/>
                <value caption="Input pin 3 (Input Mode = 2)" name="PIN3" value="0x03"/>
                <value caption="Input pin 4 (Input Mode = 3)" name="PIN4" value="0x00"/>
                <value caption="Input pin 5 (Input Mode = 3)" name="PIN5" value="0x01"/>
                <value caption="Input pin 6 (Input Mode = 3)" name="PIN6" value="0x02"/>
                <value caption="Input pin 7 (Input Mode = 3)" name="PIN7" value="0x03"/>
                <value caption="PAD Ground (Input Mode = 2)" name="GND_MODE3" value="0x05"/>
                <value caption="Internal Ground (Input Mode = 2)" name="INTGND_MODE3" value="0x07"/>
                <value caption="Internal Ground (Input Mode = 3)" name="INTGND_MODE4" value="0x04"/>
                <value caption="PAD Ground (Input Mode = 3)" name="GND_MODE4" value="0x07"/>
            </value-group>
            <value-group caption="Interrupt mode" name="ADC_CH_INTMODE">
                <value caption="Interrupt on conversion complete" name="COMPLETE" value="0x00"/>
                <value caption="Interrupt on result below compare value" name="BELOW" value="0x01"/>
                <value caption="Interrupt on result above compare value" name="ABOVE" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="ADC_CH_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Averaged Number of Samples" name="ADC_SAMPNUM">
                <value caption="1 Sample" name="1X" value="0x00"/>
                <value caption="2 Samples" name="2X" value="0x01"/>
                <value caption="4 Samples" name="4X" value="0x02"/>
                <value caption="8 Samples" name="8X" value="0x03"/>
                <value caption="16 Samples" name="16X" value="0x04"/>
                <value caption="32 Samples" name="32X" value="0x05"/>
                <value caption="64 Samples" name="64X" value="0x06"/>
                <value caption="128 Samples" name="128X" value="0x07"/>
                <value caption="256 Samples" name="256X" value="0x08"/>
                <value caption="512 Samples" name="512X" value="0x09"/>
                <value caption="1024 Samples" name="1024X" value="0x0A"/>
            </value-group>
            <interrupt-group name="ADC">
                <interrupt index="0" name="CH0" caption="ADC Channel Interrupt"/>
            </interrupt-group>
        </module>
