bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
            <value-group caption="Master Command" name="TWI_MASTER_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Issue Repeated Start Condition" name="REPSTART" value="0x01"/>
                <value caption="Receive or Transmit Data" name="RECVTRANS" value="0x02"/>
                <value caption="Issue Stop Condition" name="STOP" value="0x03"/>
            </value-group>
            <value-group caption="Master Bus State" name="TWI_MASTER_BUSSTATE">
                <value caption="Unknown Bus State" name="UNKNOWN" value="0x00"/>
                <value caption="Bus is Idle" name="IDLE" value="0x01"/>
                <value caption="This Module Controls The Bus" name="OWNER" value="0x02"/>
                <value caption="The Bus is Busy" name="BUSY" value="0x03"/>
            </value-group>
            <value-group caption="Slave Interrupt Level" name="TWI_SLAVE_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Slave Command" name="TWI_SLAVE_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Used To Complete a Transaction" name="COMPTRANS" value="0x02"/>
                <value caption="Used in Response to Address/Data Interrupt" name="RESPONSE" value="0x03"/>
            </value-group>
            <value-group caption="Master Timeout" name="TWI_MASTER_TTIMEOUT">
                <value caption="25 Milliseconds" name="25MS" value="0x000"/>
                <value caption="24 Milliseconds" name="24MS" value="0x001"/>
                <value caption="23 Milliseconds" name="23MS" value="0x002"/>
                <value caption="22 Milliseconds" name="22MS" value="0x003"/>
                <value caption="26 Milliseconds" name="26MS" value="0x004"/>
                <value caption="27 Milliseconds" name="27MS" value="0x005"/>
                <value caption="28 Milliseconds" name="28MS" value="0x006"/>
                <value caption="29 Milliseconds" name="29MS" value="0x007"/>
            </value-group>
            <value-group caption="Slave Ttimeout" name="TWI_SLAVE_TTIMEOUT">
                <value caption="25 Milliseconds" name="25MS" value="0x000"/>
                <value caption="24 Milliseconds" name="24MS" value="0x001"/>
                <value caption="23 Milliseconds" name="23MS" value="0x002"/>
                <value caption="22 Milliseconds" name="22MS" value="0x003"/>
                <value caption="26 Milliseconds" name="26MS" value="0x004"/>
                <value caption="27 Milliseconds" name="27MS" value="0x005"/>
                <value caption="28 Milliseconds" name="28MS" value="0x006"/>
                <value caption="29 Milliseconds" name="29MS" value="0x007"/>
            </value-group>
            <value-group caption="Master/Slave Extend Timeout" name="TWI_MASTER_TMSEXT">
                <value caption="Tmext 10ms Tsext 25ms" name="10MS25MS" value="0x00"/>
                <value caption="Tmext 9ms  Tsext 24ms" name="9MS24MS" value="0x01"/>
                <value caption="Tmext 11ms Tsext 26ms" name="11MS26MS" value="0x02"/>
                <value caption="Tmext 12ms Tsext 27ms" name="12MS27MS" value="0x03"/>
            </value-group>
            <interrupt-group name="TWI">
                <interrupt index="0" name="TWIS" caption="TWI Slave Interrupt"/>
                <interrupt index="1" name="TWIM" caption="TWI Master Interrupt"/>
            </interrupt-group>
        </module>
        <module name="PORT" id="I6075" version="XMEGAE" caption="Port Configuration">
            <register-group caption="I/O Ports" name="PORT" size="24">
                <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
                <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
                <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
                <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
                <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
                <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
                <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
                <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
                <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
                    <bitfield caption="Port Interrupt Level" mask="0x03" name="INTLVL" values="PORT_INTLVL"/>
                </register>
                <register caption="Port Interrupt Mask" name="INTMASK" offset="0x0A" size="1"/>
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
                    <bitfield caption="Pin 7 Interrupt Flag" mask="0x80" name="INT7IF"/>
                    <bitfield caption="Pin 6 Interrupt Flag" mask="0x40" name="INT6IF"/>
                    <bitfield caption="Pin 5 Interrupt Flag" mask="0x20" name="INT5IF"/>
                    <bitfield caption="Pin 4 Interrupt Flag" mask="0x10" name="INT4IF"/>
                    <bitfield caption="Pin 3 Interrupt Flag" mask="0x08" name="INT3IF"/>
                    <bitfield caption="Pin 2 Interrupt Flag" mask="0x04" name="INT2IF"/>
                    <bitfield caption="Pin 1 Interrupt Flag" mask="0x02" name="INT1IF"/>
                    <bitfield caption="Pin 0 Interrupt Flag" mask="0x01" name="INT0IF"/>
                </register>
                <register caption="Pin Remap Register" name="REMAP" offset="0x0E" size="1">
                    <bitfield caption="Usart0" mask="0x10" name="USART0"/>
                    <bitfield caption="Timer/Counter 4 Output Compare D" mask="0x08" name="TC4D"/>
                    <bitfield caption="Timer/Counter 4 Output Compare C" mask="0x04" name="TC4C"/>
                    <bitfield caption="Timer/Counter 4 Output Compare B" mask="0x02" name="TC4B"/>
                    <bitfield caption="Timer/Counter 4 Output Compare A" mask="0x01" name="TC4A"/>
                </register>
