bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
            <value-group caption="Compare or Capture Low Channel D Mode" name="TC45_LCCDMODE">
                <value caption="Channel Disabled" name="DISABLE" value="0x00"/>
                <value caption="Output Compare enabled" name="COMP" value="0x01"/>
                <value caption="Input Capture enabled" name="CAPT" value="0x02"/>
                <value caption="Both Compare and Capture enabled" name="BOTHCC" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture High Channel A Mode" name="TC45_HCCAMODE">
                <value caption="Channel Disabled" name="DISABLE" value="0x00"/>
                <value caption="Output Compare enabled" name="COMP" value="0x01"/>
                <value caption="Input Capture enabled" name="CAPT" value="0x02"/>
                <value caption="Both Compare and Capture enabled" name="BOTHCC" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture High Channel B Mode" name="TC45_HCCBMODE">
                <value caption="Channel Disabled" name="DISABLE" value="0x00"/>
                <value caption="Output Compare enabled" name="COMP" value="0x01"/>
                <value caption="Input Capture enabled" name="CAPT" value="0x02"/>
                <value caption="Both Compare and Capture enabled" name="BOTHCC" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture High Channel C Mode" name="TC45_HCCCMODE">
                <value caption="Channel Disabled" name="DISABLE" value="0x00"/>
                <value caption="Output Compare enabled" name="COMP" value="0x01"/>
                <value caption="Input Capture enabled" name="CAPT" value="0x02"/>
                <value caption="Both Compare and Capture enabled" name="BOTHCC" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture High Channel D Mode" name="TC45_HCCDMODE">
                <value caption="Channel Disabled" name="DISABLE" value="0x00"/>
                <value caption="Output Compare enabled" name="COMP" value="0x01"/>
                <value caption="Input Capture enabled" name="CAPT" value="0x02"/>
                <value caption="Both Compare and Capture enabled" name="BOTHCC" value="0x03"/>
            </value-group>
            <value-group caption="Timer Trigger Restart Interrupt Level" name="TC45_TRGINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Error Interrupt Level" name="TC45_ERRINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt Level" name="TC45_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Channel A Interrupt Level" name="TC45_CCAINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Channel B Interrupt Level" name="TC45_CCBINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Channel C Interrupt Level" name="TC45_CCCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Channel D Interrupt Level" name="TC45_CCDINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Low Channel A Interrupt Level" name="TC45_LCCAINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture Low Channel B Interrupt Level" name="TC45_LCCBINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
