bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32E5.xml
            <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
                <value caption="1.6 V" name="1V6" value="0x07"/>
                <value caption="1.8 V" name="1V8" value="0x06"/>
                <value caption="2.0 V" name="2V0" value="0x05"/>
                <value caption="2.2 V" name="2V2" value="0x04"/>
                <value caption="2.4 V" name="2V4" value="0x03"/>
                <value caption="2.6 V" name="2V6" value="0x02"/>
                <value caption="2.8 V" name="2V8" value="0x01"/>
                <value caption="3.0 V" name="3V0" value="0x00"/>
            </value-group>
        </module>
        <module name="SIGROW" id="I3620" version="XMEGAE" caption="Signature Row">
            <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="64">
                <register caption="RCOSC 8MHz Calibration Value" name="RCOSC8M" offset="0x00" size="1"/>
                <register caption="RCOSC 32.768 kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value A" name="RCOSC32MA" offset="0x04" size="1"/>
                <register caption="Lot Number Byte 0, ASCII" name="LOTNUM0" offset="0x08" size="1"/>
                <register caption="Lot Number Byte 1, ASCII" name="LOTNUM1" offset="0x09" size="1"/>
                <register caption="Lot Number Byte 2, ASCII" name="LOTNUM2" offset="0x0A" size="1"/>
                <register caption="Lot Number Byte 3, ASCII" name="LOTNUM3" offset="0x0B" size="1"/>
                <register caption="Lot Number Byte 4, ASCII" name="LOTNUM4" offset="0x0C" size="1"/>
                <register caption="Lot Number Byte 5, ASCII" name="LOTNUM5" offset="0x0D" size="1"/>
                <register caption="Wafer Number" name="WAFNUM" offset="0x10" size="1"/>
                <register caption="Wafer Coordinate X Byte 0" name="COORDX0" offset="0x12" size="1"/>
                <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
                <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
                <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
                <register caption="Temperature corresponds to TEMPSENSE3/2" name="ROOMTEMP" offset="0x1E" size="1"/>
                <register caption="Temperature corresponds to TEMPSENSE1/0" name="HOTTEMP" offset="0x1F" size="1"/>
                <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
                <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
                <register caption="ACA Current Calibration Byte" name="ACACURRCAL" offset="0x28" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 2" name="TEMPSENSE2" offset="0x2C" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 3" name="TEMPSENSE3" offset="0x2D" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 1" name="TEMPSENSE1" offset="0x2F" size="1"/>
                <register caption="DACA0 Calibration Byte 0" name="DACA0OFFCAL" offset="0x30" size="1"/>
                <register caption="DACA0 Calibration Byte 1" name="DACA0GAINCAL" offset="0x31" size="1"/>
                <register caption="DACA1 Calibration Byte 0" name="DACA1OFFCAL" offset="0x34" size="1"/>
                <register caption="DACA1 Calibration Byte 1" name="DACA1GAINCAL" offset="0x35" size="1"/>
            </register-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_QFN_32">
            <pin pad="GND" position="1"/>
            <pin pad="PA4" position="2"/>
            <pin pad="PA3" position="3"/>
            <pin pad="PA2" position="4"/>
            <pin pad="PA1" position="5"/>
            <pin pad="PA0" position="6"/>
            <pin pad="PDI" position="7"/>
            <pin pad="RESET" position="8"/>
            <pin pad="PC7" position="9"/>
            <pin pad="PC6" position="10"/>
            <pin pad="PC5" position="11"/>
            <pin pad="PC4" position="12"/>
            <pin pad="PC3" position="13"/>
            <pin pad="PC2" position="14"/>
            <pin pad="PC1" position="15"/>
            <pin pad="PC0" position="16"/>
            <pin pad="VCC" position="17"/>
            <pin pad="GND" position="18"/>
            <pin pad="PR1" position="19"/>
            <pin pad="PR0" position="20"/>
            <pin pad="PD7" position="21"/>
            <pin pad="PD6" position="22"/>
            <pin pad="PD5" position="23"/>
            <pin pad="PD4" position="24"/>
            <pin pad="PD3" position="25"/>
            <pin pad="PD2" position="26"/>
            <pin pad="PD1" position="27"/>
            <pin pad="PD0" position="28"/>
            <pin pad="PA7" position="29"/>
            <pin pad="PA6" position="30"/>
            <pin pad="PA5" position="31"/>
            <pin pad="AVCC" position="32"/>
        </pinout>
    </pinouts>
</target-description-file>
